functionalTests/nonNewtonianVoidfractionIcoFoam/simpleShear/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
     top
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    left
    {
	type		cyclic;
    }
    right
    {
	type		cyclic;
    }

    front
    {
	type		cyclic;
    }

    back
    {
	type		cyclic;
    }
}

// ************************************************************************* //
